In [9]:
# import numpy and pandas
import numpy as np
import pandas as pd

In [10]:
# define number of runners to take from each dataset
numRunnersToAnalyze = 100;

In [11]:
# read several datasets
data1=pd.read_fwf('Women2015.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data1['year']=2015
data1['gender']='F'
data2=pd.read_fwf('Women2019.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data2['year']=2019
data2['gender']='F'
data3=pd.read_fwf('Men2015.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data3['year']=2015
data3['gender']='M'
data4=pd.read_fwf('Men2019.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data4['year']=2019
data4['gender']='M'

data5=pd.read_fwf('Women2013.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data5['year']=2013
data5['gender']='F'
data6=pd.read_fwf('Women2018.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data6['year']=2018
data6['gender']='F'
data7=pd.read_fwf('Men2013.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data7['year']=2013
data7['gender']='M'
data8=pd.read_fwf('Men2018.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)
data8['year']=2018
data8['gender']='M'

# concatenate the data into one data frame
final=pd.concat([data1, data2, data3, data4,data5,data6,data7,data8])
final.head()

      time               name country place marathon day month  year gender
0  2:19:25     Gladys CHERONO     KEN     1   Berlin  27   SEP  2015      F
1  2:19:52        Mare DIBABA     ETH     1   Xiamen   3   JAN  2015      F
2  2:20:02   Aselefech MERGIA     ETH     1    Dubai  23   JAN  2015      F
3  2:20:03     Gladys CHERONO     KEN     2    Dubai  23   JAN  2015      F
4  2:20:21  Lucy Wangui KABUU     KEN     3    Dubai  23   JAN  2015      F

In [13]:
def timeToSeconds(time):
    temp=time.split(':')
    return 3600*int(temp[0])+60*int(temp[1])+int(temp[2])

In [19]:
final['seconds']=final['time'].apply(lambda x: timeToSeconds(x))

In [20]:
final.head()

,time,name,country,place,marathon,day,month,year,gender,seconds
0,2:19:57,Rita Jeptoo,KEN,1,Chicago,13,OCT,2013,F,8397
1,2:20:15,Priscah Jeptoo,KEN,1,London,21,APR,2013,F,8415
2,2:20:48,Jemima Jelegat,KEN,2,Chicago,13,OCT,2013,F,8448
3,2:21:05,Feyse Tadesse,ETH,1,Paris,7,APR,2013,F,8465
4,2:21:13,Florence Kiplagat,KEN,1,Berlin,29,SEP,2013,F,8473

Output the file with time in seconds for use in KNIME

In [21]:
final.to_csv('outputforKNIME.csv')

In [16]:
final.groupby(['year','gender']).describe()['seconds']

             count     mean         std     min      25%     50%      75%  \
year gender
2013 F       100.0  8711.01  108.202345  8397.0  8628.75  8743.5  8801.00
     M       100.0  7638.51   76.462507  7403.0  7594.75  7664.0  7697.00
2015 F       100.0  8680.72  111.784522  8365.0  8619.25  8682.0  8774.50
     M       100.0  7647.51   62.861158  7440.0  7607.50  7662.5  7696.25
2018 F       100.0  8577.08  117.733021  8291.0  8504.25  8601.0  8672.00
     M       100.0  7587.38   76.949909  7299.0  7548.50  7599.0  7650.50
2019 F       100.0  8534.72  121.842346  8044.0  8460.25  8566.0  8630.00
     M       100.0  7552.71   70.937203  7301.0  7515.25  7572.5  7608.25

                max
year gender
2013 F       8867.0
     M       7726.0
2015 F       8836.0
     M       7733.0
2018 F       8739.0
     M       7693.0
2019 F       8746.0
     M       7635.0

In [17]:
W2013=pd.read_fwf('Women2013.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

W2013['year']=2013 ; W2013['gender']='F'

W2018=pd.read_fwf('Women2018.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

W2018['year']=2018 ; W2018['gender']='F'

W2015=pd.read_fwf('Women2015.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

W2015['year']=2015 ; W2015['gender']='F'

W2019=pd.read_fwf('Women2019.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

W2019['year']=2019 ; W2019['gender']='F'

M2013=pd.read_fwf('Men2013.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

M2013['year']=2013 ; M2013['gender']='M'

M2018=pd.read_fwf('Men2018.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

M2018['year']=2018 ; M2018['gender']='M'

M2015=pd.read_fwf('Men2015.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

M2015['year']=2015 ; M2015['gender']='M'

M2019=pd.read_fwf('Men2019.txt', names=["time","name","country","place","marathon","day","month"]).head(numRunnersToAnalyze)

M2019['year']=2019 ; M2019['gender']='M'


final = pd.concat([W2013, W2018, W2015, W2019, M2013, M2018, M2015, M2019])

final.head()

      time               name country place marathon day month  year gender
0  2:19:57        Rita Jeptoo     KEN     1  Chicago  13   OCT  2013      F
1  2:20:15     Priscah Jeptoo     KEN     1   London  21   APR  2013      F
2  2:20:48     Jemima Jelegat     KEN     2  Chicago  13   OCT  2013      F
3  2:21:05      Feyse Tadesse     ETH     1    Paris   7   APR  2013      F
4  2:21:13  Florence Kiplagat     KEN     1   Berlin  29   SEP  2013      F

In [18]:
final['seconds']=final['time'].apply(lambda x: timeToSeconds(x))